stevenj/avr-libc3/include/avr/io/atmega8a.h
/*
================================================================================
Fuses/LockBits/Signatures
================================================================================
*/

/* ============ Fuses ============ */

#define FUSE_MEMORY_SIZE 1 

/* Fuse offset 0x00 */
#define SUT_CKSEL0 (unsigned char)~_BV(0) /* Select Clock Source bit 0 */
#define SUT_CKSEL1 (unsigned char)~_BV(1) /* Select Clock Source bit 1 */
#define SUT_CKSEL2 (unsigned char)~_BV(2) /* Select Clock Source bit 2 */
#define SUT_CKSEL3 (unsigned char)~_BV(3) /* Select Clock Source bit 3 */
#define SUT_CKSEL4 (unsigned char)~_BV(4) /* Select Clock Source bit 4 */
#define SUT_CKSEL5 (unsigned char)~_BV(5) /* Select Clock Source bit 5 */
#define BODEN      (unsigned char)~_BV(6) /* Brown-out detection enabled */
#define BODLEVEL   (unsigned char)~_BV(7) /* Brownout detector trigger level */

/* Fuse offset 0x01 */
#define BOOTRST  (unsigned char)~_BV(0) /* Boot Reset vector Enabled */
#define BOOTSZ0  (unsigned char)~_BV(1) /* Select Boot Size bit 0 */
#define BOOTSZ1  (unsigned char)~_BV(2) /* Select Boot Size bit 1 */
#define EESAVE   (unsigned char)~_BV(3) /* Preserve EEPROM through the Chip Erase cycle */
#define CKOPT    (unsigned char)~_BV(4) /* CKOPT fuse (operation dependent of CKSEL fuses) */
#define SPIEN    (unsigned char)~_BV(5) /* Serial program downloading (SPI) enabled */
#define WDTON    (unsigned char)~_BV(6) /* Watch-dog Timer always on */
#define RSTDISBL (unsigned char)~_BV(7) /* Reset Disabled (Enable PC6 as i/o pin) */


/* ========== Lock Bits ========== */
#define __LOCK_BITS_EXIST  


/* ========== Signature ========== */
#define SIGNATURE_0 (0x1E) 
#define SIGNATURE_1 (0x93) 
#define SIGNATURE_2 (0x07) 

#endif /* #ifdef _AVR_ATmega8A_H_INCLUDED */
